//Створіть базовий клас Транспорт, який містить поля для назви транспортного засобу (Назва) та максимальної швидкості (МаксимальнаШвидкість).

//Створіть похідний клас Автомобіль, який успадковує Транспорт. 
//Додайте до класу Автомобіль додаткове поле КількістьДверей.
//Створіть конструктор для класу Автомобіль, який приймає аргументи для ініціалізації Назви, МаксимальноїШвидкості та КількостіДверей,
//і викликає конструктор базового класу з використанням оператора base.

//Створіть похідний клас Велосипед, який успадковує Транспорт. Додайте до класу Велосипед додаткове поле ТипВелосипеда.
//Створіть конструктор для класу Велосипед, який приймає аргументи для ініціалізації Назви,
//МаксимальноїШвидкості та ТипуВелосипеда, і викликає конструктор базового класу з використанням оператора base.

//Створіть об'єкти класу Автомобіль та Велосипед, ініціалізуйте їх поля і виведіть інформацію про ці транспортні засоби на консоль.

//Створіть метод Move, використайте техніку virtual/override.
using System;
namespace Lesson_12
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Auto auto = new Auto("Fiat 500 Sport", 220, 2);
            Bicycle bicycle = new Bicycle("Forerunner", 30, "Mountain Bike");
            auto.Move();
            bicycle.Move();
            Console.WriteLine("Information about the moving transport:");
            Console.WriteLine($"Type: {auto.Type}, Max speed: {auto.Speed}, amount of the doors: {auto.amountdoors}");
            Console.WriteLine($"Type: {bicycle.Type}, Max speed: {bicycle.Speed}");
        }
    }
}
